Tekla.Structures.DrawingInternal.grDrawingCreationSource_e
Database operation drawing creation sources. These must be identical to #define's in TS-code.
drawing_editor_event_tracking.hpp

Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.Undefined


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.CreateFabricationDrawing


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.CreateFabricationDrawingInService


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.CreateAssemblyDrawing


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.CreateCastUnitDrawing


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.CreateSinglePartDrawing


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.OpenAPIDrawingCreation


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.DocumentManager


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.Numbering


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.DrawingProperties


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.MasterDrawingCatalog


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.AutoDrawings


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.CreateGADrawing


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.CreateMultidrawing


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.DevTestMenu


Tekla.Structures.DrawingInternal.grDrawingCreationSource_e.ViewsSidePane
